# I.Exploration des données

## Étape 1 : Chargement des données

#### 1.Importer les bibliothèques nécessaires :

In [63]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt
import seaborn as sns

#### 1.Charger le dataset :

In [64]:
df =  pd.read_csv("Loan_Prediction.csv")
df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area
0,LP001015,Male,Yes,0,Graduate,No,5720,0,110.0,360.0,1.0,Urban
1,LP001022,Male,Yes,1,Graduate,No,3076,1500,126.0,360.0,1.0,Urban
2,LP001031,Male,Yes,2,Graduate,No,5000,1800,208.0,360.0,1.0,Urban
3,LP001035,Male,Yes,2,Graduate,No,2340,2546,100.0,360.0,NaN,Urban
4,LP001051,Male,No,0,Not Graduate,No,3276,0,78.0,360.0,1.0,Urban

In [65]:
print(df.info())  # Affiche les types de données et les valeurs manquantes
print(df.shape)   # Affiche le nombre de lignes et de colonnes

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 367 entries, 0 to 366
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Loan_ID            367 non-null    object
 1   Gender             356 non-null    object
 2   Married            367 non-null    object
 3   Dependents         357 non-null    object
 4   Education          367 non-null    object
 5   Self_Employed      344 non-null    object
 6   ApplicantIncome    367 non-null    int64
 7   CoapplicantIncome  367 non-null    int64
 8   LoanAmount         362 non-null    float64
 9   Loan_Amount_Term   361 non-null    float64
 10  Credit_History     338 non-null    float64
 11  Property_Area      367 non-null    object
dtypes: float64(3), int64(2), object(7)
memory usage: 34.5+ KB
None
(367, 12)

In [66]:
# Afficher les valeurs manquantent
print(df.isnull().sum())

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            5
Loan_Amount_Term      6
Credit_History       29
Property_Area         0
dtype: int64

In [67]:
# Remplacer les valeurs manquantes
df[['LoanAmount','Loan_Amount_Term','Credit_History']] = df[['LoanAmount','Loan_Amount_Term','Credit_History']].interpolate(method='linear') #pour les varibale numérique
df[['Gender' , "Dependents" , "Self_Employed"]].fillna(df[['Gender' , "Dependents" , "Self_Employed"]].mode().iloc[0]) #pour les variables catégorielles

    Gender Dependents Self_Employed
0     Male          0            No
1     Male          1            No
2     Male          2            No
3     Male          2            No
4     Male          0            No
..     ...        ...           ...
362   Male         3+           Yes
363   Male          0            No
364   Male          0            No
365   Male          0            No
366   Male          0           Yes

[367 rows x 3 columns]

In [73]:
df.dropna() #Supprimer les valeurs manquantes
df.shape #afficher le nombre de lignes et de colonnes

Loan_ID               0
Gender               11
Married               0
Dependents           10
Education             0
Self_Employed        23
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount            0
Loan_Amount_Term      0
Credit_History        0
Property_Area         0
dtype: int64